       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXEMPLO18.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 WRK-CONTADOR PIC 9(02) VALUE ZEROS.
       PROCEDURE DIVISION.
           PERFORM VARYING WRK-CONTADOR FROM 1 BY 1
           UNTIL WRK-CONTADOR > 10
               DISPLAY WRK-CONTADOR
           END-PERFORM.
           STOP RUN.
