       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXEMPLO12.
      *CONVERTE O USO DO . PARA O USO D VIRGULA
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 WRK-VALOR1 PIC 9(02) VALUE ZEROS.
       77 WRK-VALOR2 PIC 9(02) VALUE ZEROS.
       77 WRK-RESUL PIC 9(02) VALUE ZEROS.
       77 WRK-FORM PIC Z9 VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-VALOR1 FROM CONSOLE.
           ACCEPT WRK-VALOR2 FROM CONSOLE.
           COMPUTE WRK-RESUL = (WRK-VALOR1 + WRK-VALOR2) / 2.
      *    MOVE WRK-RESUL TO WRK-FORM.
      *    DISPLAY WRK-FORM.
      *    VARIAS POSSIBILIDADES DE SITUACOES
           EVALUATE WRK-RESUL
               WHEN 7 THRU 10
                   DISPLAY 'APROVADO'
               WHEN 4 THRU 6,9
                   DISPLAY 'EXAME'
               WHEN OTHER
                   DISPLAY 'REPROVADO'
               END-EVALUATE.
           STOP RUN.
