       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXEMPLO3.
      *************
      *GUILHERME R.B
      *CRIAR UM EXEMPLO
      *************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'TESTE'.
           STOP RUN.
