       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXEMPLO1.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 WRK-TESTE PICTURE X(10) VALUE SPACES.
       PROCEDURE DIVISION.
           ACCEPT WRK-TESTE FROM CONSOLE.
           DISPLAY WRK-TESTE.
           STOP RUN.