       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXEMPLO13.
      *CONVERTE O USO DO . PARA O USO D VIRGULA
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 WRK-ESTADO PIC X(02) VALUE SPACES.
       77 WRK-PRODUTO PIC X(10) VALUE SPACES.
       77 WRK-VALOR PIC 9(04) VALUE ZEROS.
       77 WRK-RESULT PIC 9(10) VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-PRODUTO FROM CONSOLE.
           ACCEPT WRK-VALOR FROM CONSOLE.
           ACCEPT WRK-ESTADO FROM CONSOLE.

           DISPLAY WRK-PRODUTO.
           DISPLAY WRK-VALOR.
           DISPLAY WRK-ESTADO.

           EVALUATE WRK-ESTADO
               WHEN 'SP'
                   COMPUTE WRK-RESULT = WRK-VALOR * 1,05
                   DISPLAY WRK-RESULT
               WHEN 'RJ'
                   COMPUTE WRK-RESULT = WRK-VALOR * 1,10
                   DISPLAY WRK-RESULT
               WHEN OTHER
                   DISPLAY 'NAO ENTREGA'
           END-EVALUATE.
           STOP RUN.
