       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXEMPLO14.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 WRK-VALOR1 PIC 9(02) VALUE ZEROS.
       77 WRK-VALOR2 PIC 9(02) VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-VALOR1 FROM CONSOLE.
           ACCEPT WRK-VALOR2 FROM CONSOLE.
           IF WRK-VALOR1 > 10 AND WRK-VALOR2 > 10
               DISPLAY 'TESTE1'
           ELSE
               DISPLAY 'TESTE2'
           END-IF.
           STOP RUN.
