       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXEMPLO10.
      *************
      *GUILHERME R.B
      *CRIAR UM EXEMPLO
      *************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-VALOR1 PIC 9(10) VALUE ZEROS.
       77 WRK-VALOR2 PIC 9(10) VALUE ZEROS.
      *COLOCAR O S NA FRENTE DO DO VALOR S9(10) FAZ MOSTRAR O SINAL
       77 WRK-RES PIC S9(10) VALUE ZEROS.
      *MASCARA
       77 WRK-RES-SUM PIC -ZZ9 VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-VALOR1 FROM CONSOLE.
           ACCEPT WRK-VALOR2 FROM CONSOLE.
           DISPLAY '===================='.
           SUBTRACT WRK-VALOR1 FROM WRK-VALOR2 GIVING WRK-RES.
           MOVE WRK-RES TO WRK-RES-SUM.
           DISPLAY WRK-RES-SUM.
           DISPLAY '===================='.
           STOP RUN.
