       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXEMPLO4.
      *************
      *GUILHERME R.B
      *CRIAR UM EXEMPLO
      *************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *77 -> MODELO DE VARIAVEL GLOBAL, LOCAL, UNICA
      *WRK-NOME -> NOME DA VARIAVEL
      *PICTURE -> DEFINE O FUNCAO, PODE SER ESCRITA COMO PIC
      *A -> ALFABETICA, X -> ALFANUMERICO, 9 -> SOMENTE NUMERICO
      *XXX -> VARIAVEL DE 3 CARACTERES DE TAMANHO OU X(3)
      *PODE JA SETAR UM PRE VALOR USANDO VALUE COM O CONTEUDO
       77 WRK-NOME PICTURE X(20) VALUE SPACES.
       PROCEDURE DIVISION.
      *DEFINE DE ONDE A VARIAVEL VAI SER RCEBIDA
           ACCEPT WRK-NOME FROM CONSOLE.
           DISPLAY WRK-NOME.
           DISPLAY 'TESTE DE SAIDA... ' WRK-NOME.
      *PEGA PARTE DO ARRAY VARIAVEL(1:10) PEGAS AS 10 PRIMEIRAS POCISOES
           STOP RUN.
