       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXEMPLO15.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 WRK-ENTRADA PIC Z(09) VALUE SPACES.
       PROCEDURE DIVISION.
      *DIVISAO DO TRABALHO EM PARAGRAFOS
      *É TIPO O HEADER DO PHP, PODE ENCAIXAR IF E ELSE ENTRE OS PARAGRAF
       0001-PRINCIPAL.
           PERFORM 0011-M1.
           PERFORM 0002-INICIALIZAR.
           PERFORM 0003-FINALIZAR.
           STOP RUN.
       0011-M1.
           DISPLAY 'TESTE1'.
       0002-INICIALIZAR.
           DISPLAY 'TESTE2'.
       0003-FINALIZAR.
           DISPLAY 'TESTE3'.
