      *EXPLICANDO AREAS DE TRABALHO
       IDENTIFICATION DIVISION.
      *DOCUMENTACAO SOBRE O PROGRAMA
       PROGRAM-ID. EXEMPLO1.
       AUTHOR. GUILHERME.
       ENVIRONMENT DIVISION.
      *I/O PERIFERICOS
       DATA DIVISION.
      *I/O FILES
       FILE SECTION.
       WORKING-STORAGE SECTION.
      *AREA DE VARIAVEIS
       PROCEDURE DIVISION.
      *PROGRAMA EM SI, AREA DE PROCESSAMENTO
      *VARIAVEIS VALIDAS E NAO VALIDAS  
       0001-PRINCIPAL.
           DISPLAY '''TYPES PRINTS'''.
           DISPLAY 100.
           DISPLAY +100.
           DISPLAY +100.9.
           DISPLAY -100.9.
           DISPLAY '‘This isn’’t invalid’'.
           DISPLAY '1,0'.
           DISPLAY '10.'.
           DISPLAY '10,9-'.
           STOP RUN.
      *EXECUTANDO A CHAMADA
       0001-PRINCIPAL.