       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXEMPLO19.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
      *VARIAVEL TIPO TABELA
       01 WRK-MESES.
           02 WRK-MES PIC X(09) OCCURS 12 TIMES.
       PROCEDURE DIVISION.
      *TABALHO A NIVEL DE ARRAY
           MOVE 'JANEIRO' TO WRK-MES(01).
           MOVE 'JANEIRO' TO WRK-MES(02).
           MOVE 'JANEIRO' TO WRK-MES(03).
           MOVE 'JANEIRO' TO WRK-MES(04).
           MOVE 'JANEIRO' TO WRK-MES(05).
           STOP RUN.
