       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXEMPLO5.
      *************
      *GUILHERME R.B
      *CRIAR UM EXEMPLO
      *************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *VARIAVEL PAI QUE PODE DESCER ATE O NIVEL 49
      *VARIAVEL ESTRUTURADA
       01 WRK-DATA.
           02 WRK-ANO PIC 9(04) VALUE ZEROS.
           02 WRK-MES PIC 9(02) VALUE ZEROS.
           02 WRK-DIA PIC 9(02) VALUE ZEROS.
       PROCEDURE DIVISION.
      *RECUPERANDO A DATA ATUAL
           ACCEPT WRK-DATA FROM DATE YYYYMMDD.
           DISPLAY 'DATA...' WRK-DATA.
           DISPLAY 'DATA: ' WRK-DIA '-' WRK-MES '-' WRK-ANO.
           STOP RUN.
