       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXEMPLO4.
      *************
      *GUILHERME R.B
      *CRIAR UM EXEMPLO
      *************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-CPF PIC Z(11) VALUE ZEROS.
       77 WRK-CPF-FORM PIC $999.999.999.99 VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-CPF FROM CONSOLE.
           MOVE WRK-CPF TO WRK-CPF-FORM.
           DISPLAY 'CPF:  ' WRK-CPF-FORM.
           STOP RUN.
