      *EXPLICANDO AREAS DE TRABALHO
       IDENTIFICATION DIVISION.
      *DOCUMENTACAO SOBRE O PROGRAMA
       PROGRAM-ID. EXEMPLO31.
       AUTHOR. GUILHERME.
       ENVIRONMENT DIVISION.
      *I/O PERIFERICOS
       DATA DIVISION.
      *I/O FILES
       FILE SECTION.
       WORKING-STORAGE SECTION.
      *AREA DE VARIAVEIS
       77 WRK-A PIC 9(02) VALUE ZEROS.
       77 WRK-B PIC 9(02) VALUE ZEROS.
       77 WRK-C PIC 9(02) VALUE ZEROS.
       PROCEDURE DIVISION.
      *PROGRAMA EM SI, AREA DE PROCESSAMENTO
      *VARIAVEIS VALIDAS E NAO VALIDAS  
       0001-PRINCIPAL.
      *MOVENDO UM VALOR PARA DENTRO DE UMA VARIAVEL
           MOVE 6 TO WRK-A.
           MOVE 7 TO WRK-B.
           MOVE 20 TO WRK-C.
      *FAZ A MULTIPLICACAO DE (A*B)=C
           MULTIPLY WRK-A BY WRK-B GIVING WRK-C.
           STOP RUN.
      *EXECUTANDO A CHAMADA
       0001-PRINCIPAL.