       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXEMPLO36.
       AUTHOR. GUILHERME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY 'TESTE'.
           STOP RUN.
       END PROGRAM EXEMPLO36.
